package Education.Java.days16;

public class Ex07 {
	public static void main(String[] args) {
		
	/* [ 인터페이스(interface) ]
	 * 1. 자바의 자료형
	 * 		ㄴ 기본형 8가지
	 * 		ㄴ 참조형 : 배열, 클래스(String), 인터페이스
	 * 2. 변수 선언
	 * 		자료형 변수명;
	 * 		클래스 객체명;
	 *  	배열[] 배열명;
	 *  	인터페이스 객체명;
	 * 3. 일종의 추상클래스이다.
	 * 4. 필드와 일반 메서드의 선언이 1개도 없으면 인터페이스이다.
	 * 		-> 인터페이스는 상수와 추상메서드만 선언되어 있다.
	 * 			+ JDK 1.8부터 추가된 기능
	 * 					1) static 메서드 사용 가능
	 * 					2) default 메서드 사용 가능
	 * 5. 인터페이스 끼리 상속 가능하다.
	 * 		( extends )
	 * 6. 인터페이스를 사용하면 다중 상속이 가능하다.
	 * 7. 인터페이스를 구현할 때는 implements 키워드를 사용해서 클래스를 선언한다.
	 * 8. 인터페이스 안의 필드(상수)는 
	 * 		public static final 키워드가 앞에 붙는다. - 생략해도 컴파일러가 붙여서 컴파일 함
	 * 		인터페이스 안의 메서드는
	 * 		public abstract 키워드가 앞에 붙는다. - 생략해도 컴파일러가 붙여서 컴파일 함
	 *  
	 */
		
		
		
	} //main
} //class
